mvtcode/esp32-project/src/main.cpp
#include "config_manager.h"
#include "lunar_calendar.h"
#include "reset_button.h"
#include "web_server.h"
#include <Arduino.h>
#include <ArduinoJson.h>
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#include <FastLED.h>
#include <HTTPClient.h>
#include <WiFi.h>
#include <time.h>

// Configuration data loaded from NVS
ConfigData deviceConfig;
#define PANEL_RES_X 64
#define PANEL_RES_Y 32
#define PANEL_CHAIN 1

MatrixPanel_I2S_DMA *dma_display = nullptr;
uint8_t globalHue = 0;

// Weather API URL (will be built dynamically from config)
String weatherApiUrl = "";
bool isConfigMode = false; // Flag to indicate if in AP config mode
float temperature = 0.0;
int humidity = 0;
unsigned long lastWeatherUpdate = 0;
const unsigned long weatherUpdateInterval =
    600000; // 10 minutes in milliseconds
bool hasWeatherData = false;

// FreeRTOS task handle and mutex for thread-safe weather updates
TaskHandle_t weatherTaskHandle = NULL;
SemaphoreHandle_t weatherMutex = NULL;

// Lunar calendar variables
int lunarDay = 0;
int lunarMonth = 0;
int lunarYear = 0;
int lastCalculatedDay = -1; // Cache: chỉ tính lại khi sang ngày mới

// Brightness and sleep mode
bool isSleeping = false;
unsigned long lastSleepCheck = 0;

uint16_t hsvToRgb565(uint8_t hue, uint8_t sat, uint8_t val) {
  CRGB rgb;
  CHSV hsv(hue, sat, val);
  hsv2rgb_rainbow(hsv, rgb);
  return dma_display->color565(rgb.r, rgb.g, rgb.b);
}

// Bitmap cho chữ "Thứ" (15x8 pixels)
// T = 84, h = 68, ứ = u + dấu
const uint8_t thuBitmap[8] = {0b11111000, // T
                              0b00100000, // h
                              0b00100110, // ứ (u)
                              0b00100110, //
                              0b00100110, //
                              0b00100110, //
                              0b00100011, // dấu ứ
                              0b00000000};

// Hàm vẽ chữ "Thứ" tùy chỉnh
void drawThu(int16_t x, int16_t y, uint16_t color) {
  // Vẽ chữ "T"
  dma_display->drawLine(x, y, x + 4, y, color);         // Ngang trên
  dma_display->drawLine(x + 2, y, x + 2, y + 6, color); // Dọc

  // Vẽ chữ "h"
  dma_display->drawLine(x + 6, y, x + 6, y + 6, color); // Dọc trái
  dma_display->drawPixel(x + 7, y + 3, color);          // Cong
  dma_display->drawPixel(x + 8, y + 4, color);
  dma_display->drawPixel(x + 8, y + 5, color);
  dma_display->drawPixel(x + 8, y + 6, color);

  // Vẽ chữ "ư" (u + dấu)
  dma_display->drawLine(x + 10, y + 3, x + 10, y + 6, color); // Dọc trái
  dma_display->drawLine(x + 13, y + 3, x + 13, y + 6, color); // Dọc phải
  dma_display->drawPixel(x + 11, y + 6, color);               // Đáy
  dma_display->drawPixel(x + 12, y + 6, color);
  dma_display->drawPixel(x + 14, y + 4, color); // Dấu ngang

  // Vẽ dấu sắc (/)
  dma_display->drawPixel(x + 12, y + 1, color);
  dma_display->drawPixel(x + 13, y, color);
}

// Hàm vẽ chữ "ậ" (a + dấu mũ + dấu nặng) tùy chỉnh
// Dựa theo pattern 5x8 pixels từ hình mẫu
void drawACircumflexDotBelow(int16_t x, int16_t y, uint16_t color) {
  // Hàng 0: Dấu mũ (^) - đỉnh
  dma_display->drawPixel(x + 2, y, color);

  // Hàng 1: Dấu mũ - hai bên
  dma_display->drawPixel(x + 1, y + 1, color);
  dma_display->drawPixel(x + 3, y + 1, color);

  // Hàng 2: Trống (khoảng cách giữa dấu mũ và chữ a)

  // Hàng 3: Phần trên của chữ "a" - 3 pixel ngang
  dma_display->drawPixel(x + 1, y + 3, color);
  dma_display->drawPixel(x + 2, y + 3, color);
  dma_display->drawPixel(x + 3, y + 3, color);
  dma_display->drawPixel(x + 4, y + 3, color);

  // Hàng 4: Cạnh trái và phải của "a"
  dma_display->drawPixel(x, y + 4, color);
  dma_display->drawPixel(x + 4, y + 4, color);
  dma_display->drawPixel(x, y + 5, color);
  dma_display->drawPixel(x + 4, y + 5, color);

  // Hàng 5: Đáy của "a" - 3 pixel ngang ở giữa + cạnh phải
  dma_display->drawPixel(x + 1, y + 6, color);
  dma_display->drawPixel(x + 2, y + 6, color);
  dma_display->drawPixel(x + 3, y + 6, color);
  dma_display->drawPixel(x + 4, y + 6, color);
  dma_display->drawPixel(x + 5, y + 6, color);

  // Hàng 6: Trống (khoảng cách trước dấu nặng)

  // Hàng 7: Trống (khoảng cách trước dấu nặng)

  // Hàng 8: Dấu nặng (chấm dưới)
  dma_display->drawPixel(x + 2, y + 8, color);
}

// Connect to WiFi using stored configuration
// Connect to WiFi using stored configuration with retry mechanism
void connectWiFi() {
  static int retryCount = 0;
  static unsigned long lastRetryTime = 0;

  Serial.println("Connecting WiFi...");
  Serial.printf("SSID: %s\n", deviceConfig.ssid);
  Serial.printf("Retry attempt: %d\n", retryCount);

  // Show "Waiting WiFi..." on LED display
  dma_display->clearScreen();
  dma_display->setTextSize(1);
  dma_display->setCursor(2, 4);
  dma_display->setTextColor(dma_display->color565(255, 165, 0)); // Orange color
  dma_display->print("Waiting");
  dma_display->setCursor(4, 20);
  dma_display->print("WiFi...");

  WiFi.mode(WIFI_STA);
  WiFi.begin(deviceConfig.ssid, deviceConfig.password);

  // Calculate timeout based on retry count (exponential backoff)
  // First attempt: 10s, then 11s, 12s, 13s, etc. (max 30s)
  int timeoutSeconds = min(10 + retryCount, 30);
  int timeout = 0;
  int maxTimeout = timeoutSeconds * 2; // *2 because delay is 500ms

  Serial.printf("Timeout: %d seconds\n", timeoutSeconds);

  while (WiFi.status() != WL_CONNECTED && timeout < maxTimeout) {
    delay(500);
    Serial.print(".");
    timeout++;

    // Blink display every second to show activity
    if (timeout % 2 == 0) {
      dma_display->clearScreen();
    } else {
      dma_display->setCursor(2, 4);
      dma_display->setTextColor(dma_display->color565(255, 165, 0));
      dma_display->print("Waiting");
      dma_display->setCursor(4, 20);
      dma_display->print("WiFi...");
    }
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi Connected!");
    Serial.print("IP Address: ");
    Serial.println(WiFi.localIP());
    configTime(7 * 3600, 0, "pool.ntp.org");

    // Reset retry count on successful connection
    retryCount = 0;

    // Show success message briefly
    dma_display->clearScreen();
    dma_display->setCursor(2, 4);
    dma_display->setTextColor(dma_display->color565(0, 255, 0)); // Green
    dma_display->print("WiFi OK!");
    delay(1000);
  } else {
    Serial.println("\nWiFi Failed! Will retry...");
    retryCount++;
    lastRetryTime = millis();

