mvtcode/esp32-project/src/main.cpp
    // Show retry message
    dma_display->clearScreen();
    dma_display->setCursor(2, 4);
    dma_display->setTextColor(dma_display->color565(255, 0, 0)); // Red
    dma_display->print("WiFi");
    dma_display->setCursor(2, 14);
    dma_display->print("Failed");
    dma_display->setCursor(2, 24);
    dma_display->printf("Retry:%d", retryCount);
    delay(2000);

    // Disconnect and retry
    WiFi.disconnect();
    delay(1000);
    connectWiFi(); // Recursive retry
  }
}

// Lunar calendar implementation moved to lunar_calendar.cpp

// Hàm lấy dữ liệu thời tiết từ Open-Meteo API (thread-safe)
void fetchWeatherData() {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("WiFi not connected, skipping weather update");
    return;
  }

  if (weatherApiUrl.length() == 0) {
    Serial.println("Weather API URL not configured");
    return;
  }

  Serial.println("[Weather Task] Fetching weather data...");
  HTTPClient http;
  http.begin(weatherApiUrl.c_str());
  http.setTimeout(5000); // 5 second timeout
  int httpCode = http.GET();

  if (httpCode == 200) {
    String payload = http.getString();
    Serial.println("[Weather Task] API Response received");

    // Parse JSON
    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, payload);

    if (!error) {
      // Lock mutex before updating shared variables
      if (xSemaphoreTake(weatherMutex, portMAX_DELAY) == pdTRUE) {
        temperature = doc["current"]["temperature_2m"];
        humidity = doc["current"]["relative_humidity_2m"];
        hasWeatherData = true;
        xSemaphoreGive(weatherMutex);
        Serial.printf("[Weather Task] Updated: %.1f°C, %d%%\n", temperature,
                      humidity);
      }
    } else {
      Serial.print("[Weather Task] JSON parse error: ");
      Serial.println(error.c_str());
    }
  } else {
    Serial.printf("[Weather Task] HTTP GET failed, error: %d\n", httpCode);
  }

  http.end();
  lastWeatherUpdate = millis();
}

// FreeRTOS task for background weather updates
void weatherUpdateTask(void *parameter) {
  Serial.println("[Weather Task] Started on Core " + String(xPortGetCoreID()));

  // Initial fetch after 5 seconds
  vTaskDelay(5000 / portTICK_PERIOD_MS);
  fetchWeatherData();

  // Periodic updates every 10 minutes
  while (true) {
    vTaskDelay(weatherUpdateInterval / portTICK_PERIOD_MS);
    fetchWeatherData();
  }
}

// Check and apply sleep mode (called every minute)
void checkSleepMode() {
  if (!deviceConfig.sleepEnabled) {
    // Sleep mode disabled
    if (isSleeping) {
      isSleeping = false;
      dma_display->setBrightness8(deviceConfig.brightness);
      Serial.println("[Sleep] Sleep mode disabled, restoring brightness");
    }
    return;
  }

  struct tm timeinfo;
  if (!getLocalTime(&timeinfo)) {
    return; // No time available
  }

  int currentMinutes = timeinfo.tm_hour * 60 + timeinfo.tm_min;
  int sleepMinutes = deviceConfig.sleepHour * 60 + deviceConfig.sleepMinute;
  int wakeMinutes = deviceConfig.wakeHour * 60 + deviceConfig.wakeMinute;

  bool shouldSleep;
  if (sleepMinutes < wakeMinutes) {
    // Normal case: e.g., 23:00 - 06:00
    shouldSleep =
        (currentMinutes >= sleepMinutes && currentMinutes < wakeMinutes);
  } else {
    // Cross-midnight: e.g., 06:00 - 23:00 means sleep=OFF from 06:00-23:00
    shouldSleep =
        !(currentMinutes >= wakeMinutes && currentMinutes < sleepMinutes);
  }

  if (shouldSleep != isSleeping) {
    isSleeping = shouldSleep;
    uint8_t targetBrightness =
        shouldSleep ? deviceConfig.sleepBrightness : deviceConfig.brightness;
    dma_display->setBrightness8(targetBrightness);

    Serial.printf("[Sleep] Mode changed: %s, brightness: %d\n",
                  shouldSleep ? "SLEEPING" : "AWAKE", targetBrightness);
  }
}

// Update brightness in runtime (called from web API)
void updateBrightnessRuntime(uint8_t brightness) {
  deviceConfig.brightness = brightness;

  // Apply immediately if not sleeping
  if (!isSleeping) {
    dma_display->setBrightness8(brightness);
    Serial.printf("[Brightness] Updated to %d\n", brightness);
  } else {
    Serial.printf("[Brightness] Config updated to %d, but in sleep mode "
                  "(brightness: %d)\n",
                  brightness, deviceConfig.sleepBrightness);
  }

  // Sync globalConfig in web_server
  extern ConfigData globalConfig;
  globalConfig.brightness = brightness;
}

void setup() {
  Serial.begin(115200);
  Serial.println("\n\n=== ESP32 LED Matrix Clock v2.0 ===");

  // 1. Initialize LED Matrix first
  HUB75_I2S_CFG mxconfig(PANEL_RES_X, PANEL_RES_Y, PANEL_CHAIN);
  mxconfig.gpio.r1 = 25;
  mxconfig.gpio.g1 = 26;
  mxconfig.gpio.b1 = 27;
  mxconfig.gpio.r2 = 14;
  mxconfig.gpio.g2 = 12;
  mxconfig.gpio.b2 = 13;
  mxconfig.gpio.a = 23;
  mxconfig.gpio.b = 19;
  mxconfig.gpio.c = 5;
  mxconfig.gpio.d = 17;
  mxconfig.gpio.e = 18;
  mxconfig.gpio.clk = 16;
  mxconfig.gpio.lat = 4;
  mxconfig.gpio.oe = 15;

  dma_display = new MatrixPanel_I2S_DMA(mxconfig);
  if (!dma_display->begin()) {
    Serial.println("Failed to initialize DMA Display!");
  }
  // Set brightness from config (or default 100)
  dma_display->setBrightness8(100); // Will be updated after config load
  dma_display->clearScreen();

  dma_display->setCursor(2, 8);
  dma_display->setTextColor(dma_display->color565(255, 0, 0));
  dma_display->print("BOOTING...");
  dma_display->setCursor(6, 20);
  dma_display->print("v 2.0.1");
  delay(500);

  // 2. Load configuration from NVS
  loadConfig(deviceConfig);

  // Export config to web_server for authentication
  extern ConfigData globalConfig;
  globalConfig = deviceConfig;

  // Apply brightness from config
  if (deviceConfig.brightness > 0) {
    dma_display->setBrightness8(deviceConfig.brightness);
  }

  // 3. Setup reset button
  setupResetButton();

  // 4. Check if configuration is valid
  if (!deviceConfig.isValid) {
    // No valid configuration - enter AP mode
    Serial.println("\n>>> NO CONFIGURATION FOUND <<<");
    Serial.println(">>> ENTERING AP CONFIGURATION MODE <<<\n");

    isConfigMode = true;

    // Display CONFIG MODE on LED matrix
    dma_display->clearScreen();
    dma_display->setTextSize(1);
    dma_display->setCursor(2, 4);
    dma_display->setTextColor(dma_display->color565(255, 128, 0));
    dma_display->print("CONFIG");
    dma_display->setCursor(2, 14);
    dma_display->print("MODE");
    dma_display->setCursor(2, 24);
    delay(1000);

    // Setup APSTA mode and web server
    setupAPSTAMode();
    setupWebServer();
    setupCaptivePortal(); // Enable captive portal DNS redirect

    Serial.println("\nConnect to WiFi: ESP32-Clock-Config");
    Serial.println("Then visit: http://192.168.4.1");
    Serial.println("\nWaiting for configuration...\n");
  } else {
    // Valid configuration exists - normal operation
    Serial.println("\n>>> CONFIGURATION LOADED <<<");
    Serial.println(">>> STARTING NORMAL MODE <<<\n");

