mvtcode/esp32-project/src/main.cpp
    isConfigMode = false;

    // Build weather API URL from stored coordinates
    weatherApiUrl = "https://api.open-meteo.com/v1/forecast?latitude=";
    weatherApiUrl += String(deviceConfig.latitude, 4);
    weatherApiUrl += "&longitude=";
    weatherApiUrl += String(deviceConfig.longitude, 4);
    weatherApiUrl += "&current=temperature_2m,relative_humidity_2m";
    Serial.println("Weather API: " + weatherApiUrl);

    // Connect to WiFi
    connectWiFi();

    // Create mutex for thread-safe weather data access
    weatherMutex = xSemaphoreCreateMutex();
    if (weatherMutex == NULL) {
      Serial.println("Failed to create weather mutex!");
    }

    // Create weather update task on Core 0 (main loop runs on Core 1)
    if (WiFi.status() == WL_CONNECTED) {
      xTaskCreatePinnedToCore(weatherUpdateTask, // Task function
                              "WeatherTask",     // Task name
                              8192,              // Stack size (bytes)
                              NULL,              // Task parameter
                              1, // Priority (lower than default)
                              &weatherTaskHandle, // Task handle
                              0                   // Core 0
      );
      Serial.println("Weather task created successfully");
    }
  }
}

void loop() {
  // Check reset button in all modes
  checkResetButton();

  // If in config mode, just blink indicator and wait
  if (isConfigMode) {
    static unsigned long lastBlink = 0;
    static bool blinkState = false;

    if (millis() - lastBlink > 500) {
      blinkState = !blinkState;
      lastBlink = millis();

      dma_display->clearScreen();
      dma_display->setTextSize(1);

      // Dòng 1: "Conf wifi:" - cố định, không nháy
      dma_display->setCursor(2, 4);
      dma_display->setTextColor(
          dma_display->color565(255, 128, 0)); // Màu cam cố định
      dma_display->print("Conf wifi:");

      // Dòng 2: "Clock-2026" - nháy
      dma_display->setCursor(2, 14);
      dma_display->setTextColor(
          blinkState ? dma_display->color565(255, 255, 255)
                     : dma_display->color565(64, 64, 64)); // Màu trắng nháy
      dma_display->print("Clock-2026");

      // Dòng 3: Hiển thị IP address với dấu chấm chỉ 1 pixel
      uint16_t ipColor = dma_display->color565(0, 255, 255);
      int currentX = 5;

      // "192"
      dma_display->setCursor(currentX, 24);
      dma_display->setTextColor(ipColor);
      dma_display->print("192");
      currentX += 18; // 3 chữ số * 6 pixels = 18px

      // Dấu chấm (1 pixel)
      dma_display->drawPixel(currentX, 30, ipColor);
      currentX += 2; // 1px cho chấm + 1px khoảng cách

      // "168"
      dma_display->setCursor(currentX, 24);
      dma_display->setTextColor(ipColor);
      dma_display->print("168");
      currentX += 18; // 3 chữ số * 6 pixels = 18px

      // Dấu chấm (1 pixel)
      dma_display->drawPixel(currentX, 30, ipColor);
      currentX += 2;

      // "4"
      dma_display->setCursor(currentX, 24);
      dma_display->setTextColor(ipColor);
      dma_display->print("4");
      currentX += 6; // 1 chữ số * 6 pixels = 6px

      // Dấu chấm (1 pixel)
      dma_display->drawPixel(currentX, 30, ipColor);
      currentX += 2;

      // "1"
      dma_display->setCursor(currentX, 24);
      dma_display->setTextColor(ipColor);
      dma_display->print("1");
    }

    handleDNS(); // Process DNS requests for captive portal
    delay(50);
    return;
  }

  // Normal operation mode
  struct tm timeinfo;
  bool hasTime = getLocalTime(&timeinfo);

  dma_display->clearScreen();

  if (hasTime) {
    // Phần vẽ đồng hồ (Giữ nguyên logic cũ của bạn)
    char hStr[3], mStr[3], sStr[3];
    sprintf(hStr, "%02d", timeinfo.tm_hour);
    sprintf(mStr, "%02d", timeinfo.tm_min);
    sprintf(sStr, "%02d", timeinfo.tm_sec);

    dma_display->setTextSize(2);
    // Vẽ Giờ
    dma_display->setCursor(1, 2);
    dma_display->setTextColor(hsvToRgb565(globalHue, 255, 255));
    dma_display->print(hStr);
    // Dấu :
    // dma_display->setCursor(21, 2);
    // dma_display->print(":");
    // Dấu : với hiệu ứng chạy vào nhau
    // Tính toán vị trí dựa trên millisecond trong giây (0-999ms)
    unsigned long ms = millis() % 1000; // Lặp lại mỗi giây
    float progress = ms / 1000.0;       // 0.0 -> 1.0

    // Tạo hiệu ứng đi xuống rồi lên (ping-pong)
    float offset;
    if (progress < 0.5) {
      // Nửa đầu: chạy vào nhau (0 -> 1)
      offset = progress * 2.0; // 0.0 -> 1.0
    } else {
      // Nửa sau: chạy ra (1 -> 0)
      offset = (1.0 - progress) * 2.0; // 1.0 -> 0.0
    }

    // Vị trí gốc của dấu : khi size=2 là tại (21, 2)
    // Với textSize(2), mỗi pixel có kích thước 2x2
    int baseX = 25;      // Tâm của dấu :
    int topDotY = 4;     // Vị trí gốc của chấm trên
    int bottomDotY = 12; // Vị trí gốc của chấm dưới
    int maxMove = 5;     // Khoảng cách tối đa di chuyển (pixels)

    // Tính vị trí hiện tại
    int currentTopY = topDotY + (int)(offset * maxMove);
    int currentBottomY = bottomDotY - (int)(offset * maxMove);

    // Vẽ hai chấm với kích thước 2x2 (giống textSize(2))
    uint16_t colonColor = hsvToRgb565(globalHue + 20, 255, 255);
    dma_display->fillRect(baseX, currentTopY, 2, 2, colonColor);
    dma_display->fillRect(baseX, currentBottomY, 2, 2, colonColor);
    // Vẽ Phút
    dma_display->setCursor(29, 2);
    dma_display->setTextColor(hsvToRgb565(globalHue + 40, 255, 255));
    dma_display->print(mStr);
    // Vẽ Giây (với gradient cho từng chữ số)
    dma_display->setTextSize(1);
    // Chữ số giây thứ nhất
    dma_display->setCursor(52, 9);
    dma_display->setTextColor(hsvToRgb565(globalHue + 80, 255, 255));
    dma_display->print(sStr[0]);
    // Chữ số giây thứ hai
    dma_display->setCursor(58, 9);
    dma_display->setTextColor(hsvToRgb565(globalHue + 100, 255, 255));
    dma_display->print(sStr[1]);

    // Vẽ dòng 2: Luân phiên giữa Thứ/Ngày và Nhiệt độ/Độ ẩm mỗi 5 giây
    dma_display->setTextSize(1);

