mvtcode/esp32-project/src/main.cpp
    // Tính toán chế độ hiển thị dựa trên thời gian (5 giây mỗi chế độ, 3 modes)
    unsigned long currentTime = millis() / 5000; // Chia cho 5000ms = 5 giây
    int displayMode =
        currentTime % 3; // 0 = ngày/tháng, 1 = thời tiết, 2 = âm lịch

    // Thread-safe check for weather data availability
    bool showWeather = false;
    float tempDisplay = 0.0;
    int humDisplay = 0;

    if (xSemaphoreTake(weatherMutex, 10 / portTICK_PERIOD_MS) == pdTRUE) {
      showWeather = hasWeatherData;
      tempDisplay = temperature;
      humDisplay = humidity;
      xSemaphoreGive(weatherMutex);
    }

    if (displayMode == 1 && showWeather) {
      // Hiển thị Nhiệt độ và Độ ẩm với nhãn T và H
      // Format: "T 23.1°C  H 79%" với gradient colors

      // Tách phần nguyên và phần thập phân của nhiệt độ (using thread-safe
      // copies)
      int tempInt = (int)tempDisplay;
      int tempDec =
          (int)((tempDisplay - tempInt) * 10); // Lấy 1 chữ số thập phân

      char tempIntStr[5], tempDecStr[2], humStr[8];
      sprintf(tempIntStr, "%d", tempInt);
      sprintf(tempDecStr, "%d", tempDec);
      sprintf(humStr, "%d%%", humDisplay);

      // Bắt đầu từ vị trí cố định
      int currentX = 1; // Bắt đầu từ pixel 1

      // Vẽ "T" với gradient
      // dma_display->setCursor(currentX, 23);
      // dma_display->setTextColor(hsvToRgb565(globalHue + currentX * 2, 255,
      // 255)); dma_display->print("T");
      currentX += 4;

      // Vẽ phần nguyên (23) - từng chữ số với gradient
      currentX -= 1;
      for (int i = 0; i < strlen(tempIntStr); i++) {
        dma_display->setCursor(currentX, 23);
        dma_display->setTextColor(
            hsvToRgb565(globalHue + currentX * 2, 255, 255));
        dma_display->print(tempIntStr[i]);
        currentX += 6;
      }

      // Vẽ dấu chấm (.) - chỉ 1 pixel
      dma_display->drawPixel(currentX, 29,
                             hsvToRgb565(globalHue + currentX * 2, 255, 255));
      currentX += 2;

      // Vẽ phần thập phân (1)
      dma_display->setCursor(currentX, 23);
      dma_display->setTextColor(
          hsvToRgb565(globalHue + currentX * 2, 255, 255));
      dma_display->print(tempDecStr);
      currentX += strlen(tempDecStr) * 6;

      // Vẽ ký tự độ (°) - vòng tròn nhỏ
      dma_display->drawCircle(currentX + 1, 24, 1,
                              hsvToRgb565(globalHue + currentX * 2, 255, 255));
      currentX += 3;

      // Vẽ "C"
      dma_display->setCursor(currentX, 23);
      dma_display->setTextColor(
          hsvToRgb565(globalHue + currentX * 2, 255, 255));
      dma_display->print("C");
      currentX += 6 + 6; // C (6px) + space (6px)

      // Vẽ "H"
      currentX = 40;
      // dma_display->setCursor(currentX, 23);
      // dma_display->setTextColor(hsvToRgb565(globalHue + currentX * 2, 255,
      // 255)); dma_display->print("H"); currentX += 6; // H (6px)

      // Vẽ độ ẩm - từng ký tự với gradient
      for (int i = 0; i < strlen(humStr); i++) {
        dma_display->setCursor(currentX, 23);
        dma_display->setTextColor(
            hsvToRgb565(globalHue + currentX * 2, 255, 255));
        dma_display->print(humStr[i]);
        currentX += 6;
      }
    } else if (displayMode == 2) {
      // Mode 2: Hiển thị Âm lịch
      // Chỉ tính lại khi sang ngày mới (cache)
      if (lastCalculatedDay != timeinfo.tm_mday) {
        solarToLunar(timeinfo.tm_year + 1900, timeinfo.tm_mon + 1,
                     timeinfo.tm_mday, lunarDay, lunarMonth, lunarYear);
        lastCalculatedDay = timeinfo.tm_mday;
      }

      char lunarStr[16];
      sprintf(lunarStr, "AL%02d/%02d/%02d", lunarDay, lunarMonth,
              lunarYear % 100);

      // Hiển thị với gradient
      int currentX = 2;

      for (int i = 0; i < strlen(lunarStr); i++) {
        dma_display->setCursor(currentX, 23);
        dma_display->setTextColor(
            hsvToRgb565(globalHue + currentX * 2, 255, 255));
        dma_display->print(lunarStr[i]);
        currentX += 6;
      }
    } else {
      // Hiển thị Thứ và Ngày/Tháng - từng ký tự với gradient theo vị trí X

      if (timeinfo.tm_wday == 0) {
        // Chủ nhật - hiển thị "CNhật" với gradient từng ký tự
        dma_display->setCursor(2, 23);
        dma_display->setTextColor(hsvToRgb565(globalHue + 2 * 2, 255, 255));
        dma_display->print("C");

        dma_display->setCursor(8, 23);
        dma_display->setTextColor(hsvToRgb565(globalHue + 8 * 2, 255, 255));
        dma_display->print("N");

        dma_display->setCursor(14, 23);
        dma_display->setTextColor(hsvToRgb565(globalHue + 14 * 2, 255, 255));
        dma_display->print("h");

        // Vẽ chữ "ậ" tùy chỉnh
        drawACircumflexDotBelow(20, 23,
                                hsvToRgb565(globalHue + 20 * 2, 255, 255));

        dma_display->setCursor(26, 23);
        dma_display->setTextColor(hsvToRgb565(globalHue + 26 * 2, 255, 255));
        dma_display->print("t");
      } else {
        // Thứ 2-7 - vẽ "Thứ" + số với gradient theo vị trí
        // Vẽ "Thứ" tùy chỉnh - màu dựa trên vị trí x=2
        drawThu(2, 23, hsvToRgb565(globalHue + 2 * 2, 255, 255));

        dma_display->setCursor(18, 23);
        dma_display->setTextColor(hsvToRgb565(globalHue + 18 * 2, 255, 255));
        dma_display->print(timeinfo.tm_wday + 1); // 1->2, 2->3, ..., 6->7

        // Dấu phẩy sau thứ - vị trí x=24
        dma_display->setCursor(24, 23);
        dma_display->setTextColor(hsvToRgb565(globalHue + 24 * 2, 255, 255));
        dma_display->print(",");
      }

      // Hiển thị ngày/tháng DD/MM ở vị trí cố định với gradient từng ký tự
      char dateStr[12];
      sprintf(dateStr, "%02d/%02d", timeinfo.tm_mday, timeinfo.tm_mon + 1);
      int currentX = 34; // Vị trí cố định
      for (int i = 0; i < strlen(dateStr); i++) {
        dma_display->setCursor(currentX, 23);
        dma_display->setTextColor(
            hsvToRgb565(globalHue + currentX * 2, 255, 255));
        dma_display->print(dateStr[i]);
        currentX += 6;
      }
    }
  } else {
    // No time available yet - WiFi connection is being handled by connectWiFi()
    // Just wait a bit before next iteration
    delay(100);
  }

  // Weather updates now handled by background task - no blocking calls here!

  // Check sleep mode every minute
  if (millis() - lastSleepCheck > 60000) {
    checkSleepMode();
    lastSleepCheck = millis();
  }

  // Handle DNS for captive portal (needed in APSTA mode)
  handleDNS();

  globalHue += 1;
  delay(100);
}